# Operaciones CRUD en Cassandra

In [5]:
%load_ext cql

The cql extension is already loaded. To reload it, use:
  %reload_ext cql

In [18]:
%%cql
DROP KEYSPACE demo

'No results.'

In [7]:
%%cql
CREATE KEYSPACE demo 
WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 1};

'No results.'

In [8]:
%keyspace demo

Using keyspace demo

In [9]:
%cql select release_version from system.local;

+-----------------+
| release_version |
+-----------------+
|      3.0.9      |
+-----------------+

In [10]:
%%cql
CREATE TABLE users (
firstname text, 
lastname text, 
age int, 
email text, 
city text, 
PRIMARY KEY (lastname));

'No results.'

In [11]:
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('John', 'Smith', 46, 'johnsmith@email.com', 'Sacramento'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Jane', 'Doe', 36, 'janedoe@email.com', 'Beverly Hills'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Rob', 'Byrne', 24, 'robbyrne@email.com', 'San Diego');

'No results.'

In [12]:
%cql SELECT * FROM users;

+----------+-----+---------------+---------------------+-----------+
| lastname | age |      city     |        email        | firstname |
+----------+-----+---------------+---------------------+-----------+
|   Doe    |  36 | Beverly Hills |  janedoe@email.com  |    Jane   |
|  Byrne   |  24 |   San Diego   |  robbyrne@email.com |    Rob    |
|  Smith   |  46 |   Sacramento  | johnsmith@email.com |    John   |
+----------+-----+---------------+---------------------+-----------+

In [13]:
%cql SELECT * FROM users WHERE lastname= 'Doe';

+----------+-----+---------------+-------------------+-----------+
| lastname | age |      city     |       email       | firstname |
+----------+-----+---------------+-------------------+-----------+
|   Doe    |  36 | Beverly Hills | janedoe@email.com |    Jane   |
+----------+-----+---------------+-------------------+-----------+

In [14]:
%cql UPDATE users SET city= 'San Jose' WHERE lastname= 'Doe';

'No results.'

In [15]:
%cql SELECT * FROM users where lastname= 'Doe';

+----------+-----+----------+-------------------+-----------+
| lastname | age |   city   |       email       | firstname |
+----------+-----+----------+-------------------+-----------+
|   Doe    |  36 | San Jose | janedoe@email.com |    Jane   |
+----------+-----+----------+-------------------+-----------+

In [16]:
%cql DELETE from users WHERE lastname = 'Doe';

'No results.'

In [17]:
%cql SELECT * FROM users;

+----------+-----+------------+---------------------+-----------+
| lastname | age |    city    |        email        | firstname |
+----------+-----+------------+---------------------+-----------+
|  Byrne   |  24 | San Diego  |  robbyrne@email.com |    Rob    |
|  Smith   |  46 | Sacramento | johnsmith@email.com |    John   |
+----------+-----+------------+---------------------+-----------+